[
    {
        "id": 17857600432927642,
        "created_at": 1588785965,
        "text": "Some people have asked for the recipe to my oven-baked Bovmite chicken. As usual, I don't measure the amounts of each ingredient and tend to agak agak or eyeball the amounts. Don't forget to taste as you go along.\n- brine the chicken in pink Himalayan salt and water solution. I didn't measure and just threw in a a few tablespoons to a medium mixing bowl and put the chicken in and filled up with water\n- leave to brine overnight in the fridge if you can. I didn't have time as I was cooking it up in a few hours so I let it brine for 3 hours in the fridge\n- pat dry the chicken\n- lift the chicken skin and push in some cloves of garlic\n- coat the chicken with VT's Bovmite marinade (ingredients below) and refrigerate for a few hours\n- take the chicken out of fridge for 30minutes before putting into oven\n- preheat oven to 180 degrees\n- cover chicken with baking paper and foil and bake for 20 minutes\n- take out and baste with marinade\n- bake for another 20 minutes\n- coat some oil onto skin and under 200 degree grill for 2-3 minutes until skin is browned or crispy to the level you prefer\n- Enjoy the Oven-baked Bovmite Chicken!\n.\nVT's Bovmite Marinade\n- Bovril\n- Marmite\n- Lakanto but sugar is fine if you're not doing low carb\n- Shaoxing wine\n- pepper\n- honey because I was doing wings and somehow they just need honey\n- and now the secret to a whole new level of tastiness to this dish... Kewpie mayo! Huh? Why, I hear you ask? Because it was looking at me from the fridge shelf and just because I love that @kewpieusa gives dishes a not so heavy hint of creamy flavour!\n.\nIf anyone really needs measurements for my marinade, I am more than happy to try and pay more attention to how much of each ingredient I put in the next time I make my Bovmite Chicken... Just let me know, lovelies! 😊❤️",
        "owner": {
            "id": "2297281214",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/87544964_641598469938079_1270258482125209600_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=-U9VQrWqHycAX-YbtU7&oh=c437ef2c46105725e4b0aef7063a996d&oe=5F2B714B",
            "username": "ozteopath"
        },
        "likes_count": 0,
        "answers": []
    }
]