[
    {
        "id": 18064699192214722,
        "created_at": 1589593823,
        "text": "Some Advertisements burn too much of your Marketing Budget.\nNow Check out the ALL NEW Disruptive & Innovative Advertising Technology, \"Digital Locality Advertising\"\nIt is SIMPLE, AFFORDABLE & EFFECTIVE.\nDigital Locality Advertising\nWe maximise every single dollar of your marketing budget.\nWe are able to amplify the targeted audience outreach through our integrated ONLINE & OFFLINE strategies\nWe have now a user base of more than 500,000 users and still counting to tap in.\nFull views of your Ads and not just impressions (as like FB or Instagram)\nOur Ad-Technology is designed that viewers view your ads in FULL\nImagine there is no ad blindness and viewers will watch FULLY your ad. \nThere will be a way higher chance of conversion into sales.\nIt is not just mere impressions like Facebook or Instagram.\nIt is a REAL VIEW.\nOur Ad-Tech allows Viewers to naturally share and repost your adverts everywhere\nimagine viewers posting your ads on their own social media\nThis Tactic will disrupt many current digital marketing channels\nAdvert keeps being reposted on social media\nImagine your ads being semi-viral on social media and many users are sharing your ads daily\nMinimally 5000 views per month\nOur Ad-Tech can guarantee you 5000 unique views per month\nImagine having 5000 unique views every month on our advert. \nIt is as though you have 5000 people walking into your shop!\nBesides the Unique views guarantee - viewers can repeatedly view your ads - ao your Ads can potentially reach more than 5000 a month!\nBy increasing the number of viewership, there will be likely an increase in sales.\nReply me here or whatsapp me 92345543 and I will be happy to show you how?\nDon't lag behind while other F&B are doing so. Thanks",
        "owner": {
            "id": "608860729",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/94464124_845484329280798_2122606200989155328_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=GJdPxa_bptgAX8ln7Ol&oh=cfefc3499b80fe17924541c047bf8b14&oe=5F32090F",
            "username": "hkquek"
        },
        "likes_count": 0,
        "answers": []
    }
]