[
    {
        "id": 17962503457312526,
        "created_at": 1589170874,
        "text": "Dear all,\nThank you for the lovely messages, we are touched by the love for all mothers out there!\n\nCongratulations to the following winners, kindly PM us for more details:\n\n1. @fullof567 \n2. @itskuan \n3. @swedeprince \n4. @caixia86 \n5. @zoey_belle_ \nCongrats! 🙂",
        "owner": {
            "id": "7149730756",
            "is_verified": true,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/101944956_2601691163406694_6763658645986082816_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=Z-b372jX9pEAX8Jixq6&oh=a09131e752bfdac90c30e826e6b1bf2e&oe=5F2B9BE8",
            "username": "genecosg"
        },
        "likes_count": 4,
        "answers": [
            {
                "id": 18008982850285987,
                "created_at": 1589171331,
                "text": "@genecosg thanks for selecting my entry, PM sent as requested ✅ Congratulations to the other winners too! 🤩",
                "owner": {
                    "id": "33360616",
                    "is_verified": false,
                    "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/104417000_280826889783483_8592323573106241913_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=eRpjjXIloO8AX9oxcZT&oh=cd8478164692317775533ebcdfd91d35&oe=5F2CBC4D",
                    "username": "swedeprince"
                },
                "likes_count": 0
            },
            {
                "id": 17878467637628663,
                "created_at": 1589174460,
                "text": "@genecosg ty so much❤️❤️ have pm you. Congratulations to other winners ❤️❤️💓",
                "owner": {
                    "id": "1370740",
                    "is_verified": false,
                    "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/31557014_581472548896433_406025738349707264_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=d5H4jKq21tIAX9tYXv2&oh=67a0748849af973ca147258ffe734dec&oe=5F2BD56C",
                    "username": "zoey_belle_"
                },
                "likes_count": 0
            }
        ]
    },
    {
        "id": 18141893257021000,
        "created_at": 1589120667,
        "text": "My Mummy is my Shero ❤️ She gave me life, nurtured me, taught me, dressed me, fought for me, held me, shouted at me, kissed me, but most importantly she loved me unconditionally. There are not enough words to describe just how important my Mother is to me and what a powerful influence she continues to be 💕\nMummy I Love You ❤️❤️ @rchan3338 @sokhangphang @stefinlov3",
        "owner": {
            "id": "428821634",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/79436599_2507460882818785_2207696353595752448_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=ywRdyDRsAo8AX8xJ2WS&oh=2bc66b5988ed7aecf4fd99643c47091a&oe=5F2BA302",
            "username": "foodlover_yumi"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 17910420241429810,
        "created_at": 1589113649,
        "text": "My mum although no longer around since small, taught me to always be myself and stand up for myself. Always be a man ppl will look up to and never be a guy who need a girl. I should learn how to survive and yet make meaningful friends. I am a part of community and community is a part of me. All the tough roads will make me a real man. So, never give up and keep striving. I would like to take this chance to wish her \"Happy Mother's Day\"🎉🎊😊💕💪 #powermom @jin_zhouart @johnchew_the_hungry @szefaye @genecosg",
        "owner": {
            "id": "190587323",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/15802667_1810491495896657_8149754848510738432_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=In_ym1EAOKYAX-GiLMZ&oh=111802d43d7a32d0a7fb631b444c95b1&oe=5F2E2768",
            "username": "chrislee2u"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18098080840152414,
        "created_at": 1589100905,
        "text": "My grandmother is a #powermom . She is a strong woman.🥇She look after everyone in the family. 👨‍👩‍👧‍👦 Grandma take care my beloved mother which unfortunately diagnosed with SLE. Together we fight through up and downs of the condition for 20years. Mummy have been strong. 🍀Grandma take care me, always by my side since I’m baby until now I’m adult. With her around I won’t be hungry I won’t skip a meal. She always ensure my safety, my well-being. She remembers each of everyone’s lunar birthday and will prepare longevity noodles “Shou Mian”. Grandma has back hometown now to take care of the newborn and the brother in the family. I am blessed to have her as my grandmother. ❤️ Love my grandma and mum! \nHappy Mother’s Day! 💐 @littlewashico @scbtcherishyou @happydav__",
        "owner": {
            "id": "341171900",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/89633981_517957609118989_2768163094365470720_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=m4XZ9aizwWUAX91eoq6&oh=d16ae095a0e9deb284525724546911f3&oe=5F2BFB70",
            "username": "itskuan"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 17849754872053390,
        "created_at": 1589095920,
        "text": "I must admit how I was deeply impressed with my 70yo mum who is still quite tech-savvy when she used WhatsApp to video call me during the circuit breaker period as we were living in different households 👍 The most memorable moment with my mother was when she visited me during my first few days in school. She purposely left home with packed food she had prepared, even when she was not sure if the school would let her see me since it was not visitation day. Eventually, she pleaded with the school administration to allow her to pass me the homemade food 👍 Getting to enjoy homemade food was every student's dream & while sharing the food with my friends at school, I literally boasted around about how I had the best mother in the whole world 👍👍 Hence, I would love to win this wonderful gift set generously sponsored by @genecosg for the MUM of my life 💗💗\n@kimchoo3839 @kimeng.tan.522 @caixia86",
        "owner": {
            "id": "8157352903",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/36159707_736000703400073_158930849562099712_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=9s2tGFJK5SoAX-G4XLv&oh=458ce68a9ce98320276a77d79c41610a&oe=5F2BF984",
            "username": "hing.yuen.52"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 17994299059290192,
        "created_at": 1589095126,
        "text": "My stepmother is my #powermom because she taught us logic. 👩: \"Because I said so.\" because she taught us about stamina. 👩: You sit there until you finish your veggies. Because she taught us patience. 👩: You wait till Daddy gets home. Because she taught us about irony. 👩: Cry somemore and I will male you really cry. Because she taught us science. 👩: If you don't finish your rice, your future spouse's face will have lots of pimples. ✨#powermom @saladsashimiq @missprinqueen @claire.see.313",
        "owner": {
            "id": "3295938625",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/25022566_726769470850388_8089450874859945984_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=oYJEcTPCuwcAX9PorTo&oh=62d85ca1d5c7b686919e51848e8da767&oe=5F2DC845",
            "username": "wafflespiesallthingsnice"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17906519947451478,
        "created_at": 1589092846,
        "text": "My sister is a #powermom when mother is sick or away to attend to matters because sis will pao-ka-liao such as cooking a meal for me even if it's just a simple dumplings mee sua to make sure I am not starved and to do housework to make sure house is spick and span. @kenbean3 @movieslover101 @sweety_pie1231",
        "owner": {
            "id": "9716873486",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/46748458_1044476679088921_5508514059286216704_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=IBMVm10UNmAAX8dU-Ar&oh=190dcc90f67bfcdb6b3cdd3748fe5767&oe=5F2CF356",
            "username": "chl5701"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17858012629924162,
        "created_at": 1589092513,
        "text": "Hi 👋 @genecosg !\n\nMy Power Mom is my spouse, mother of our 2 kids 👦🏻👧🏻 and 🤰 bearer of our #3 baby 👶 who will the latest addition to our 👨‍👩‍👧‍👦 anytime soon this month and she is such an incredibly inspirational lady who has overcome her own personal challenges in life and emerged stronger, and continue to make meaningful contributions to our family, our friends and our community! 💝\n\nTagged 3 friends\n@_ja.ne_ \n@alyssapy \n@shiong_c \nAll steps completed ✅ and hope to win! 🤩\n#SGUnited\n#PowertheChange\n#stayhome \n#stayhomesg\n#circuitbreakersg\n#stayhomewithgeneco",
        "owner": {
            "id": "33360616",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/104417000_280826889783483_8592323573106241913_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=eRpjjXIloO8AX9oxcZT&oh=cd8478164692317775533ebcdfd91d35&oe=5F2CBC4D",
            "username": "swedeprince"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17854045873992599,
        "created_at": 1589085037,
        "text": "Dearest Mummy,\nThank you for always there where and when I need you.My memory is full of happy times spent with you.We watched children's cartoons together, played together,cycled together,caught' long-kang' fish together -we even won a prize together playing a perfect mother-daughter game and emerged champion. It goes to show our\nchemistry just matches perfectly.\nThank you for always placing family before self and wholeheartedly brought us(5 siblings) with your meagre pay as a school teacher in a poor village in China as you're not highly educated with not much earning capacity.You thrifted and saved and had to go hungry yourself but still slogged on so that our family could have roof over our heads and never had to suffer hardship and endure poverty.\nThank you for your wisdom and our whole family had uprooted and moved to Singapore and we all had gotten our citizenship more than 10 years ago and if not for your foresight ,we would not have ventured beyond our poverty stricken rural village in Fujian,PRC\nMum,you certainly deserve more thanks and recognition that you should ever get on Mother's  Day-----lots and lots more not only on this special day 10th May 2020 but for tomorrow and forever too.@ar.eal @angelinexiaorong @aihwa6859 👌❤️",
        "owner": {
            "id": "2030639437",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/10299880_491401644340973_1582783236_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=MRilNJAuLT4AX_uQ4sF&oh=fe47d3a8d5438e5f8446358302f352fd&oe=5F2E8CB6",
            "username": "fangtangwen"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17855663152965321,
        "created_at": 1589084381,
        "text": "Hope to WIN WIN WIN this gift set from @genecosg for my dearest mummy to thank her for being such a SUPERMOM through all these years of upbringing 🤗🤗\nTo the Queen of my Heart (@kimchoo3839 ):\n1) Provider \nYou have been a steady provider and works to see that our family has the necessities of life. You have been a loyal employee in your job for the past 35 years. Given at the age of 6️⃣0️⃣, you seldom complain about being lethargic even when you need to take care of your grandchildren  during your post-retirement stage.\n2) Teacher\nYou always willingly share your knowledge and principles to help us grow and develop over the years. You never allow us to take things for granted and always remind us to cherish what we have at the present. From the food on the table to the good education you have paid for, you will make us appreciate the values in everything we have!\n3) Friend\nYou naturally show kindness, compassion and interest in our family. Whenever you are 🆓, you will spare some time to listen to us and have a good chat with us. You are just like everyone's best friend in the family! \n4) Exemplar\nYou show by the way you live an example of what the family stands for. You will not smoke if you don't want us to do it, and likewise does not drink heavily if you do not want us to do so. You taught us to deal with conflict in our family and with others by being firm but reasonable at the same time! \n5) Patriarch\nYou are honoured because of your moral character and actions. You don't expect us to live the same kind of life you do, and do the same kind of work. You respected our values and opinions, as long as they don't harm the family or anyone else! \n6) Disciplinarian\nYou helped us learn proper boundaries and consequences. You will strongly disapprove any of our misdeeds by using tough love to prove a point. You did this through the power of your words, not your fists. Likewise, you don't reward us for actions that are expected of us, such as helping with house chores or performing well in school!\nThank you for all the selfless sacrifices 💞💞\nI LOVE 💟 YOU MUM 💯💯💯 💋💋\n@potatoeeeez_ @kwok.james @hing.yuen.52",
        "owner": {
            "id": "220307792",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/97245701_718516885355103_8433609460441677824_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=Q9CBBiW3eogAX907sSA&oh=4d4fd54cdbe3c84f2640fdf16118f8ce&oe=5F2C02B2",
            "username": "caixia86"
        },
        "likes_count": 2,
        "answers": []
    },
    {
        "id": 17865522961786814,
        "created_at": 1589067569,
        "text": "❤️",
        "owner": {
            "id": "6625065786",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/47585865_520983228414251_3258492276162166784_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=FTZz9Hhjw_sAX85aBPz&oh=58d16ce33dfc0da0776832cbb29d86c0&oe=5F2EC345",
            "username": "leechobonkim"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18128155147073498,
        "created_at": 1589054280,
        "text": "My power mom is my Mom! And my Mom is the (B ) be there for me (E ) everytime I need her\n(S ) sacrifice a lot (T ) to show her unconditional love for me\n(M ) mentors me to be a better person\n(O ) open her both arms and listening ear to me anytime\n(M ) motivates me to achieve further\nI'm very thankful and grateful to my mum for single-handedly raised the 2 of us by doing two jobs, do housework till past midnight & teaches us good morales. I know it been tough on her to act dual roles as a Mother & a Father. She is the pillar of strength and source of income for the whole family. She never once complained and stayed strong throughout because she just want to give us the best she could & seeing us grow up healthy & happily. 💓 Despite we were not rich, but I was never once felt lack. My mum will save every single bit of goodness to us and provides us with everything as much as she can. She gave up the most important things in her life, so that I could take on the most important things in mine. Thankful for all the sacrifices she has made, as well as the unconditional love she has showered upon me through these years! 🥰\nBest friends come and go, boyfriends and girlfriends love and move on, but the only person present through it all is a mother.\nNow that she's old, we all are grown up and have stable job, I want to show her appreciation and gratitude every day possible. Without her unconditional love and care, we wouldn’t be who we are today!! She is also my Best Friend who listen to my problem & share my worries & happiness. Grateful for her everything. 🥰 \nThank you for the thoughtful giveaway! ❤️\nHope to win this because she is frugal and doesn’t want me to splurge on her. This is my best chance to pamper her.\nShe will definitely be thrilled & delighted. Seeing her smiles of joy is my happiest moment!! 😄 @rahrahkoh  @shalomzozo @hannah_joana__  #powermom",
        "owner": {
            "id": "1370740",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/31557014_581472548896433_406025738349707264_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=d5H4jKq21tIAX9tYXv2&oh=67a0748849af973ca147258ffe734dec&oe=5F2BD56C",
            "username": "zoey_belle_"
        },
        "likes_count": 2,
        "answers": []
    },
    {
        "id": 17864556517809469,
        "created_at": 1589048658,
        "text": "My mom is the best thing I could ever ask for. She is the most supportive and most loving mom out there. ❤️ I never knew how much she sacrificed and how much she had done for me all these years before I became a mother myself.  She had to bring up 5 kids all by herself. Those though times were hard and we did not have much money, but she was a great mom and took care of us all very well. I didn’t know how difficult it is to be a mom but now I totally feel it and experience it firsthand for myself.  Being a mom definitely is not an easy job. Yet she never complained or made a sound. It was all love and smiles. I really want to be like a mom her but I find it very hard. She is a perfect mom. I can never say enough or ever express fully in words on how much I love her and show how great she is❤. Mother's Day is meant to make mothers happy and show great appreciation to our mothers. ❤ This giveaway is perfect for my dearest mom. I am sure she will be very happy if I can win this gift for her. She is a great mom and she deserves to have the best. 💯🥇 @ic_life8 @momo_album @friendly_kat",
        "owner": {
            "id": "26738762463",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/80768546_769845710174400_443039491628728320_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=k2o86qivOGwAX8lXP7G&oh=b0a94667efa6e57bae32842b60d3ed05&oe=5F2CB577",
            "username": "happytc89"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 17915005426422592,
        "created_at": 1589041436,
        "text": "The best advice I received from my Power mum is \"It may be raining now but the sun always come out!\" I'm not a academically inclined pupil since young but my mum never give up on me. She told me life is not a bed of roses and things may not be good for me now but that doesn't mean it will stay like this forever. I am deeply touched by her wisdom and encouragement. I manage to do well in my part time degree studies and also receive recognition at work all thanks to her! \nMy mum is special to me simply because she is my first love, the first woman I'm in love with and yet afraid of her at the same time! 😆 This feeling is indescribable! Hope to surprise my first love! \nLast but not least,\nHere is a heartfelt appreciation message for her: \nYou make me everything I am.\nThank you for taking the time,\nThank you for showing me the way,\nAnd thank you for being there when I need you,\nThank you for every single day.\nThank you for your guiding hand,\nThank you for making my dreams come true,\nYou're an extraordinary woman,\nAnd I hope you're as proud of me\nAs I am proud of you.\nThank you for giving me life,\nThank you for showing me good from bad! \nThank you for all your contributions to the family,\nThank you for being my Mum.\nI love you, and I always have!\n@byteo196 @areyouhh09 @rainbowshines83 \nThanks @genecosg for this awesome giveaway!",
        "owner": {
            "id": "4306248841",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/41668392_317370145510546_2740880899460562944_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=ApVtlwq2WN0AX-CZeyh&oh=622b8b55c5a9f44d51f1a0a3f17c3b9d&oe=5F2CCE50",
            "username": "fullof567"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 18129188308079341,
        "created_at": 1589037499,
        "text": "My Power Mom is my dearest mother @cky3317 because:\n\nP- (P)laying multiple roles (Clown, Nurse, Cook, Counsellor, Mediator, Disciplinarian, Cheerleader) based on situations which she excel greatly in all roles and is my \nO- (O)ne & Only Mum blessed\nW- (W)ith the special power of reading my mind and heart and know what I always want to do, craving for my favourite food, \nE- (E)mbracing me with her unconditional motherly love that protect me from bad guys and dangers, keeping me warm and safe and also my\nR- (R)ole model and idol whom I always looked up to her and proud of her by being the most Power Mum whom I always love in my heart ! \nI wish to dedicate this heartfelt poem to my Mother to show my love and appreciation:\n\nWhen I was born,\nYou were there to catch me when i fall, whenever and wherever.\nWhen I said my first words,\nYou were there for me,\nto patiently teach me the whole dictionary.\nWhen I took my first steps,\nYou were there to encourage me on and telling me not to give up till I succeed.\nWhen I had my first day at school,\nyou were there beside me, giving me advice and helping me with my homework.\nWhen I had my first day at work, you were there giving me advice and listening to me when I had problems in work,\nUntil today, deep down in your heart I will always be your \"never grow up\" child no matter what age I am & you will want to look after me, just like in the past, \nI know you will be there for me, holding my hands tightly and walking through all the good & bad times with me, giving me support along the way with your motherly love !\nI Love you Mum now & forever with all my heart for all that you have sacrificed for me & \nI will be filial & make u happy for the rest of my life ! ❤️ Liked and Followed @genecosg \n@autumnsummerinlove \n@imhelenbain \n@nexus2020",
        "owner": {
            "id": "220720507",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/15253090_981177082027137_4604622059945852928_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=bKTYv1H_94kAX9WxcBl&oh=a5bad3af1c80ac3569cdc8feadf075cc&oe=5F2CF837",
            "username": "skohhg"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 17864809795790200,
        "created_at": 1589034759,
        "text": "(Part 2) Last month in preparing for our vacation, I started packing early.  I strategized the best method for packing the kids’ clothes. I tried hard to be prepared and organized, leaving only a handful of things to pack the evening/morning before.\nExcept, the evening before we were to leave, I got sick.  Somehow a stomach bug came on in a hurry and I felt absolutely awful.  This was the beginning of one huge downhill slide, but at that point I only knew I had to be up at 4:30am to herd my family on a plane, I had a few things left to pack and I felt awful.\nI decided the wisest thing to do was to try and sleep it off.  I reasoned that it would be better to wake up earlier in the morning than to try to get my stuff done while curled up in the fetal position feeling horrible.\nSo I went to bed.  And couldn’t sleep.  I tossed and turned all night only to get up at 4 am to finish the packing.  This vacation was destined for success from the very start.\nI’m sure you can guess what 4 am looked like.  Organized and prepared packing was gone.  I was half awake throwing things in a suitcase, sleepy-eyed, tossing treats in kids’ backpacks, whatever it took to just get it done and get out the door.\nAnd my bedroom, was a mess. A pile of empty treat boxes over here, clothes that didn’t make the cut over there, the last basket of laundry that never got folded sitting on the floor.  A mess.\nIt haunted me the entire trip.  In my rational mama mind I told myself not to worry about it, life happens, it could be cleaned up when we got home.  Even my mom would give me a pass on this one.  But still, I kind of felt like I failed because I didn’t leave my house tidy.\nIt’s interesting how much power my mother’s training has over me, all of these years later.  I left home 17 years ago – I’ve almost lived away from my parents as long as I lived with them – yet my mom’s voice still plays in my head at times.  Somewhere deep, almost subconscious, my mom’s words shape my reflexes, effect my thinking, sway my decisions. She is a #powermom! \n@kenbean3 @chl5701 @movieslover101",
        "owner": {
            "id": "1230030055",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/13413450_1188689827861076_1066694121_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=HrkdsyyEfX0AX_RVXfl&oh=938bbcb41e5885c3c8286cde97c88d67&oe=5F2CF0EA",
            "username": "sweety_pie1231"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18140855407041632,
        "created_at": 1589034712,
        "text": "(Part 1) Growing up my mom had a consistent rule, we don’t leave for vacation with a messy home.  The parameters of the “vacation” were rather flexible, the terms of a clean home however, were not.  It didn’t matter if it was a long weekend, a camping trip, a big summer vacation or a quick overnighter – the house had to be clean.\nI hated that rule.\nI remember being so excited to get out the door, so anxious to get in the car and my mom was directing us around the house to put one more pair of shoes away or straighten the couch cushions or fold that stray blanket while she was buzzing about vacuuming or making sure the kitchen was orderly.\nShe always said it was worth the effort to return home to a tidy house.  I never quite understood that – until I had a home of my own.  And, of course, she was right.  Returning to a tidy home really is a pretty fabulous greeting. #powermom  @kenbean3\n @chl5701 @movieslover101",
        "owner": {
            "id": "1230030055",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/13413450_1188689827861076_1066694121_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=HrkdsyyEfX0AX_RVXfl&oh=938bbcb41e5885c3c8286cde97c88d67&oe=5F2CF0EA",
            "username": "sweety_pie1231"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18134209147064725,
        "created_at": 1589027438,
        "text": "First and foremost, thank you @genecosg for hosting this awesome Mother's Day giveaway and providing this platform for us to share the love towards our selfless mothers 👏👏👏\nAnyone can be a mother, but it takes real efforts to be a wonderful mother! Mine is the perfect example ❤ She has been the HEROINE of my life because:\n[M] aster in her culinary skills\n[O] utstanding [T] ender loving care for our family\n[H] eart of gold\n[E] ducating us in our daily lives\n[R] ole model in all ways\nTill date, it is heartwarming to reminisce my younger days when she will carry my school bag and hold my hands tightly as she walked me to and back from primary school ❤ Those were the mischievous side of me where I will beg and cry to eat ice-cream after school, and there comes my wonderful mother who will give in to my request despite knowing that I will ask for it the next time round - all because she just want to see a happy smile in me ❤ Now that I have grown up, I'm truly grateful and appreciative towards her upbringing and guidance ❤ \nWithout her motherly advice and \nwithout her ultimate sacrifice,\nI would have never been here today ❤\nWithout the support I needed from her,\nI never would have succeeded thus far ❤\nWithout her unbounded & selfless love,\nI would never become what I am today ❤\n@suanyewtoh @cherish.t16 @hing.yuen.52",
        "owner": {
            "id": "6916083",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/11850202_1479537165684920_248480064_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=96An_1XFDVAAX8FihbS&oh=3fd016f6a9e11b3d239c834569b9f88f&oe=5F2ADFB6",
            "username": "tanhk86"
        },
        "likes_count": 2,
        "answers": []
    },
    {
        "id": 17854482457967023,
        "created_at": 1589021986,
        "text": "My Power Mum is my own mum as she is my idol and definitely a superwoman! 🦸‍♀️ For example, when my dog 🐕 was sick & could not walk, she slept on the couch so that she could carry it to do the toilet for it to do it's business. She sacrificed her sleep 💤 waking up in the middle of the night 🌃 to do it and yet in the morning 🌞 she still woke up early to hand-wash all the family's clothes 👚 and cook lunch and dinner 🥘 for everyone. And all without ever complaining for years.🙏 Hope to win this lovely gift set so I can pamper her and show my appreciation for her this Mother's Day 💗💐💆‍♀️💕 @thereadingniffler @rebootinglife @elin_e_roberts",
        "owner": {
            "id": "2115925250",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/104184677_312549899767854_1977863558127575931_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=ZlF_BF8IgVAAX9nzxno&oh=acbd9669834edc3831c4b139ab0d0235&oe=5F2D383C",
            "username": "blueberrydonutlovez"
        },
        "likes_count": 2,
        "answers": []
    },
    {
        "id": 17887809508552031,
        "created_at": 1589010115,
        "text": "My mum is a power mum because being a mother of 3, she \n1. Has been there with us through every high and low \n2. Has been our biggest fan for always taking time out to support me/ my siblings whenever we perform on stage in our school days\n3. Has been a wonderful role model - strong, kind, independent and caring woman (though naggy at times)\n\nFor the past 35 years, she has dedicated her life to my sisters and I, to be a full time housewife and to take care of us and our studies. During this 35 years, she has given up on most things.. even the simplest to go out with friends. Hence, would love to win this for her @leeweechang @meihsing89 @carrebearrrr",
        "owner": {
            "id": "811636942",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/75587991_571357726999128_1721879485915070464_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=flmsX3GCGhcAX9359vR&oh=ff751c3b2b14f5a8ddaad82e763ea80b&oe=5F2EA0D6",
            "username": "_peiix2"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17897009809490333,
        "created_at": 1589009594,
        "text": "My mom always put us before her own needs, for example she always wakes up earlier in the morning so that she can boil hot water to make coffee for us before we get ready for work. She takes such great care of the family - everything is so neat and tidy, the fridge is never empty. I’m so thankful for her selfless love and I thank her for making me a better person, and for allowing me to do what I love and enjoy💓 @lewwisss @picohon @_peiix2",
        "owner": {
            "id": "29284691",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/82672786_505161690133400_2932620407196352512_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=p1MEX9ocp3cAX-0TL6P&oh=c268c8bd5247e37a2983321b8b44593a&oe=5F2BFBEE",
            "username": "carrebearrrr"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17994466672294330,
        "created_at": 1589009578,
        "text": "My mom always put us before her own needs, for example she always wakes up earlier in the morning so that she can boil hot water to make coffee for us before we get ready for work. She takes such great care of the family - everything is so neat and tidy, the fridge is never empty. I’m so thankful for her selfless love and I thank her for making me a better person, and for allowing me to do what I love and enjoy💓 @wat3rmelonjoys @eunicechenwy @weilinsta",
        "owner": {
            "id": "29284691",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/82672786_505161690133400_2932620407196352512_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=p1MEX9ocp3cAX-0TL6P&oh=c268c8bd5247e37a2983321b8b44593a&oe=5F2BFBEE",
            "username": "carrebearrrr"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 18087521197199566,
        "created_at": 1589008298,
        "text": "My mother is the glue that holds the family together. She demonstrated love, care ,  patience and build a culture of appreciation. It's only a mother's love that is unconditional , totally selfless and without any greed . To me, my mom is a powerful mom and a Superwoman. @hong_family ,  @minfei_fay @ambrie_auberta",
        "owner": {
            "id": "1338524931",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/39810472_655431418164314_3522114422443081728_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=o4RzOItVQnIAX-aduyG&oh=909ee1839675ad1e7f25a3055ea3198b&oe=5F2B3B49",
            "username": "jet_lc"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17872352356710352,
        "created_at": 1589007779,
        "text": "To me, my mum is a selfless person who holds multi positions in my life - one who protects and defends me like a soldier, dishes out advice like my BFF, supports me and comfortsr me like a sister and loves me more than anyone on Earth! ❤️ Shes the pillar in my life! \n@carrebearrrr @jenxelaw @cforcassandra",
        "owner": {
            "id": "183249750",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/10848170_399725453520130_1125919492_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=Hcb82lFfuiIAX96KGHg&oh=ca0cd13c08200242bf9649ac93122b9a&oe=5F2E6FB4",
            "username": "wat3rmelonjoys"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17852832607998875,
        "created_at": 1588991810,
        "text": "My Power Mom is my grandma.  She  raised me up together with my mum when my dad pass away when I was in primary five.  She was there for me during my difficult times when I battled with cancer and had my surgery done in 2015. She encouraged me to move on no matter how life hits me hard.  She lent me a listening ear whenever I needed one.  She passed away last year Dec. I gonna miss her so much. @wingbe11 @shandylim @juslingchen",
        "owner": {
            "id": "4639332403",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/71298386_1173334869521374_173234778579927040_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=MIN9-zfR2qoAX86CEel&oh=61d6d2d01b4986a2725bdfcc519fcc6c&oe=5F2C2795",
            "username": "selena.201"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18116839057119605,
        "created_at": 1588983649,
        "text": "The Death Glare\nPerhaps one of her most favorite superpowers. She has frozen three arguing children in their tracks with a well-timed crazy-look-in-my-eyes death glare. In the few professional sports brawls I’ve witnessed, I’ve yet to see a referee or umpire pull off this stunt. Mom is a pro in stopping we three siblings in any form of quarrel or even fight! Staying at home can lead to bonding but also fighting so her superpower is really useful in this tough times! @lcyhne @keilymissy @hasmiley321",
        "owner": {
            "id": "10670523082",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/50902214_402093547263994_9029294885793955840_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=QxF1D6tvv-4AX_pB28e&oh=cced1564d7d6faeaa9063f2cd85a5982&oe=5F2D4F1F",
            "username": "enxinneverending"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17865477832783761,
        "created_at": 1588983598,
        "text": "X-ray vision is what is special about my Mom? She generally know what’s really going on inside her child’s mind and body. It might take time to investigate, but she usually knows when something is wrong or off. Nowadays, while working from home, she stays vigilant against security risks. She always tells me that \"Just because you’re not in the office doesn’t mean you’re not a target for hackers. Your work machine is incredibly valuable for thieves and criminals, so take care to work securely.\" She is aware of how her company’s network policies such as the use of Wi-Fi, personal devices, and more. She employs a “trust but verify” mentality for documents sent to her inbox. She uses a business-grade Virtual Private Network (VPN) for encryption. She knows how to get IT assistance and report security threats. She never slacks off on her duty to keep her home office equipment secure and she wants me to understand how to protect myself from common security threats too. My superwonder techno woman in the house! @lcyhne @keilymissy @wintersnowy1",
        "owner": {
            "id": "1312539763",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/13395059_511750028995437_1572198367_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=sIGI3l64yn8AX92aXBl&oh=16faef043b6b9ea8aa43095bc489e2a7&oe=5F2DABE9",
            "username": "hasmiley321"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17857832881932160,
        "created_at": 1588983010,
        "text": "Mum seems to have superhuman  stealthiness. Before this circuit breaker, I never paid attention to the decibel level at which Mum completed everyday household chores, but when I went napping in the afternoon to take a break from my stressful almost 24/7 work from home kind of work, quietness is everything I know. She has done the dishes, laundry, rearranged furniture, stacked glass casserole dishes and coffee mugs all while making less noise than a navy seal on a covert mission. Every nap I had I was 100% undisturbed. @keilymissy @wintersnowy1 @hasmiley321",
        "owner": {
            "id": "10479783541",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/50599294_2208760939365353_8535797641630449664_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=bjIv95GqNAgAX-H1Fpd&oh=9f0c963917666510558f8fd04d0c6f86&oe=5F2DB7C4",
            "username": "lcyhne"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18105787159184480,
        "created_at": 1588957898,
        "text": "The power mom I wanted to nominate is my grandma ❤️ She is a Mum of 6 kids 😘 Since young, I have been staying with her during weekdays and only went home with my parents during weekends. When I grow up, I also stayed with her since my poly days till I got married and finally move out of her house. To me, she is my grandma but she also played a motherly role to me when I was staying with her together with my brother. She will iron my clothes for me, sew all my buttons for my clothes for me and make sure I have my favourite food everytime I eat at home. When I left her house just before I got married, we were both so sad and cried. Can’t forget those happy years when I stayed with her. I am forever grateful to her and all that she has done for me.  @eveghh @huijing21 @poppi_shv",
        "owner": {
            "id": "43534503",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/105023668_194508491915706_3437996697653204819_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=wqzV8lW9GRkAX8Qqjdr&oh=3dce6e073d2205d177c013c79f339617&oe=5F2CD272",
            "username": "princessezyt"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17857883032902220,
        "created_at": 1588950513,
        "text": "My power mum is my mother in law! She is a super mom that put us first before herself. Even when she contracted cancer, she will still want to feed my kids and let me eat & rest after I worked. She wants the best for us and always inspire us to love each other. Now that she has passed away 3 months ago, I really hope that she is in a good place now. And will put herself first and take good care of herself. Wish that she is in a better place.❤️❤️ #powermom @yihui.lu22 @kaiwoon123 @kaisin_18",
        "owner": {
            "id": "4480711388",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/91704958_288661555456591_6287879937214906368_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=GXpCvkblhwsAX-7puFm&oh=91e1db30239dfe74ea5f33e970128787&oe=5F2D5B5A",
            "username": "2littlejoys"
        },
        "likes_count": 2,
        "answers": []
    },
    {
        "id": 17932589710373711,
        "created_at": 1588943897,
        "text": "My mother is the most important person in my life. She is an inspiration to everything I do. I would not call her a friend, but she is an extraordinary person. She has been in my life since I was born and she will always be in my life no matter what happens. She is the one who has suffered to bring me into this world. I have learnt to love her from the day I was born.\nMy mother was the first person to teach me to draw and walk, and she was with me when I took my first step ever! She has taught me to believe in people and not to have grudges against one another. She always encouraged me to go along when I was ready to give up. She makes sure that I was safe and happy throughout my childhood. It is the unconditional love that my mother feels that drives these feelings.\nIt is hard to describe the feeling that a mother has towards her children. Mothers give an awful lot of support to their children, whether it involves very visible support or simple background encouragement. Not only do mothers support their children, but they also often hold the whole family structure together. When all is well, a mother puts her children before anything else, including their own comfort and happiness. Describing a mother's love is virtually impossible. It is a feeling that can only truly be understood by those that experience it. Famous saying states that \"God could not be everywhere and so he invented mothers\"! @lcyhne @hasmiley321 @tristar891 #powermom",
        "owner": {
            "id": "9293897893",
            "is_verified": false,
            "profile_pic_url": "https://instagram.ftse3-1.fna.fbcdn.net/v/t51.2885-19/44884218_345707102882519_2446069589734326272_n.jpg?_nc_ht=instagram.ftse3-1.fna.fbcdn.net&_nc_ohc=0L7oBGC_n8wAX-dlpYp&oh=75a20e2068e9154d731ed87173a23c7e&oe=5F2B678F&ig_cache_key=YW5vbnltb3VzX3Byb2ZpbGVfcGlj.2",
            "username": "wintersnowy1"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17864795398789252,
        "created_at": 1588943068,
        "text": "My Power Mom is of course my mum! She had a road accident in late February this year where a car knock her down at traffic light. She was recuperating a few weeks at my home and decided she wants to go back to the comfort of her own house. Despite her not able to walk as she suffered broken leg from the accident, she can still cook and do most of the daily living chores herself. On top of this, she will never forget to video conference everyday to check with us (my Brother and me) and see her grandchildren. My mum is 💪🏻!\n@selena.201 @reen_goh @realisticsoul",
        "owner": {
            "id": "255028795",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/11849068_907677702632579_283899574_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=3uLS1jXydMgAX_oDrUV&oh=398cef293b93fd5f0976ae861cd147a5&oe=5F2B4CDE",
            "username": "wingbe11"
        },
        "likes_count": 1,
        "answers": []
    },
    {
        "id": 18139524262040187,
        "created_at": 1588915862,
        "text": "@jacksonivyp @cnyhappy1 @silentxdisco My mother has the power of healing us and I intend to win some food delivery vouchers to heal her too. She is great at fixing up boo-boos. She knows how to bring down fevers, clean cuts and treat burns and she also know when an injury or illness is more serious and know when to take her kids and grandkids to a doctor or the hospital.  With school closures come cancelled school plays, concerts, sports matches and activities that her grandchildren are deeply disappointed about missing out on because of the coronavirus disease (COVID-19). Her number one piece of advice is to let her grandchildren be sad. In the scope of an adolescent’s life, these are major losses. This is bigger for them than it is for us adults because we’re measuring it against our lifetime and experience. She will support, expect and normalize that they are very sad and very frustrated about the losses they are mourning.When in doubt, she will offer empathy and support. Throughout this period, she understand that there is a lot of misinformation circulating about the coronavirus disease (COVID-19). As such, she will spend time to find out what her grandkids are hearing or what they think is true. She feels that it is not enough to just tell her grandchildren accurate facts, because if they have picked up something that is inaccurate, if she doesn't find out what they are thinking and directly address the misunderstanding, they may combine the new information she gives them with the old information they have. Hence, she will find out what her grandkids already know and start from there in terms of getting them on the right track. When her grandchildren have questions she can’t answer, instead of guessing, she uses it as an opportunity to explore the answers together. My mother is a healer and it is very entertaining (to me) to see her interaction with her grandkids! Although I seemed to get neglected by her at home as she focuses on her grandkids, I seem to picture myself onto my kids and it's a strange feeling!",
        "owner": {
            "id": "10873638615",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/50246539_1470476849770107_406799103045926912_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=flr8Z1iACNIAX_NlIoV&oh=a3942e9ac876900180a3dc005da73052&oe=5F2DF342",
            "username": "p1314168"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17871360943700304,
        "created_at": 1588915652,
        "text": "My mother understands me better than anyone, and I crave her approval more than anyone else’s. I could recite her entire value system if I were in a coma. Every meal needs a salad, music is good and sport is suspect, children should learn a stringed instrument, sleeping late is a moral failing. She doesn’t actually need to criticize. She did her job so effectively 30 years ago that now she need only raise an eyebrow and I fill in the blanks on autocomplete. @p1314168 @jacksonivyp @cnyhappy1",
        "owner": {
            "id": "1091845795",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/13269358_247072128994411_164253898_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=q_2jUmuE4ugAX_Uf99T&oh=ac60b49b5b3ae31667516cb653d629f5&oe=5F2C6F43",
            "username": "silentxdisco"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18093119770163008,
        "created_at": 1588914623,
        "text": "I realise that despite living in the house for like 20 plus years, I don't know where things are placed around the house and mother come to be the \"Finder of lost things\" and save my day! Mom knows where everything in the house is. Nothing is ever lost, just ask my mom and she’ll know where it is. Love you #powerMom! Happy Mother's Day! @cnyhappy1 @p1314168 @silentxdisco",
        "owner": {
            "id": "3313176676",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/50287214_287743121900589_2739393736969551872_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=bA26awUz47QAX_BeT9Q&oh=38e8e0f9135208b40d423e0f7735a41b&oe=5F2C5965",
            "username": "jacksonivyp"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17865494503804447,
        "created_at": 1588910067,
        "text": "My mother has been reading a lot of parents complain about having to spend the whole month with their child/children and she has been telling us that she wants to put a tape over their mouths. Now, she has been telling her parent friends to be thankful their child/children is/are not confined to 4 walls in a hospital. She has also been advising her parent friends that if they'all are still letting their child/children run around playgrounds while they sitting there watching them & chit chat with the other parents, is it they want to start new playground cluster [sic]? It’s pretty amazing, isn’t it? How do my mother manage to be right about everything even giving meadvises with my work during circuit breaker period too? Another thing is that I realise my mother can heal with a single hug/kiss! When it comes to an ‘ouchie’, my mother can take the pain away with just a single kiss/hug. It could be anything from a bump on the head to an annoying supervisor who keeps hurrying me to submit something he has given me so last minute; no matter if it's big, medium, or small, my mother’s kiss has this super healing ability that will magically take all the pain away. Amazing, right? Okay although we should minimize contact but this healing power of hers is what I needed most during this stressful Circuit Breaker period. 😗 @p1314168 @jacksonivyp @silentxdisco #powermom",
        "owner": {
            "id": "1312545417",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/16110174_1175974745851377_230107756261015552_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=0JWq-WQetEwAX-k5CIG&oh=0ed2dc2e80e0d345d9116c1e97ec3e28&oe=5F2C3EE3",
            "username": "cnyhappy1"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17857884667917560,
        "created_at": 1588892949,
        "text": "The powermom in my life is my mom. She is an amazing woman, despite the hard time in her marriage, she works hard to take care and provide for her children without any complains. Happy Mother's Day mum ❤️ @rtmyluv @iamting8658 @ern_ray",
        "owner": {
            "id": "22584211403",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/102866074_882469185564336_6899586529377367534_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=EiTbT5xzrIcAX9QNMN_&oh=245bdce993b8ae11299e08682439367e&oe=5F2CF7A6",
            "username": "tingomummy"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17847609368102161,
        "created_at": 1588866606,
        "text": "My power mom who is my mother doesn’t have an instagram but I’d like to take part and show it to her. I’m sure she’ll be happy. :) Here goes: \nI appreciate my mum for she turns the house into a place full of warmth called home. She is truly an amazing and strong woman for bringing me up and taking care of the household all while pursuing her aspirations of being a tutor. Many sacrifices have gone untold and she remains the same role model that I’d emulate anytime. Positivity it is! She is a wonder woman, my hero! 🤩\n\nLiked and followed \nTagged: @churavel @shwok @wanshiie",
        "owner": {
            "id": "23226959",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/92056521_2950180495043693_8891444972671205376_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=4590wtRUGRUAX93aVyv&oh=96770e8e98d9220623b5ede524e99d55&oe=5F2CB39B",
            "username": "aloisohzh"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17896965628487874,
        "created_at": 1588864191,
        "text": "My power mum is my mummy!💕💪🏻 Being a new mum to my baby girl, I have a deeper appreciation for my mum’s hard work to bring 4 kids up! I am already very tired with 1 baby, I cannot imagine how my mum managed with 4 of us! \nMy mummy’s love for her kids knows no end. Even when I am now a mum myself, my mummy continues to care for me and my baby so unconditionally. \n@yoyeoo @ziyingtan @sheisyunjoo",
        "owner": {
            "id": "203095966",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/11910347_336377459866138_26096952_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=AcW6mw6c-5gAX8W1sJC&oh=9675a511a69270a87a9ae7feb364cf49&oe=5F2ADA12",
            "username": "ich_bin_jasmin"
        },
        "likes_count": 2,
        "answers": [
            {
                "id": 17846104736123615,
                "created_at": 1588923868,
                "text": "@ich_bin_jasmin 👏🏻👏🏻👏🏻",
                "owner": {
                    "id": "480595116",
                    "is_verified": false,
                    "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/14134832_1782610168661555_1616132503_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=u8lvrrjWGDcAX8GwJku&oh=233e5829bfb13955bab035c25c079513&oe=5F2C6CC2",
                    "username": "yoyeoo"
                },
                "likes_count": 0
            }
        ]
    },
    {
        "id": 17926459801385754,
        "created_at": 1588862412,
        "text": "My mom @wong.ah.wan is the most important person to me and she is my super hero. My mom is the best because she's my biggest supporter and always have my best interest at heart. \nDuring my university days, when I am always studying late at night till 2-3am, she will ensure that I don’t go hungry by preparing supper for me. No matter is it primary school, secondary school, junior college or when choosing university courses, she always make sure she’s there to listen and give advice. Now that I’m married, she is still there to teach me how to cook and manage household matters. She love me for who I am. She’s my lifelong mentor. No matter what time it is or how busy she is, I can count on her to be there for me. I’m very fortunate that I can always turn to her and there was never a time where I felt that I'm alone. She love me for who I am. I'm grateful for her and I appreciate the role she play in my life ❤️ I am thankful to have grown up in a family full of love, laughter and memories that will live on forever. I love my mum the most ❤️ @zhenlong1974 @jojophangg @khengseng2",
        "owner": {
            "id": "26550491274",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/80775382_527557827842255_2575149158163808256_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=B0OoVOP6fdMAX9wsSSD&oh=99f1aea4a67b891ed09805b3c7375de2&oe=5F2B4D39",
            "username": "pyxjojo"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18033761905261842,
        "created_at": 1588858313,
        "text": "I hope to win and surprise my power mum as she is my role model! She was down with cancer twice, she never give up on life no matter how tough it might be! When the going get tough, the tough get going, that's what she always believes in. This is how special she is to me, because of her I'm a stronger individual too! \nHere a heartfelt message for this iron lady in my heart:\nYou are as compassionate as an angel,\nWho guided me out of darkness,\nYou ignited the sparks in me and drive me out of sadness!\nMy dearest mum, it is your unconditional love that help me recovered from sadness when things were not going their way.\nYou are the one who hold my hand, when others walk away!\nYou are the one who dry my tears and show me the way!\nYou make me believe that the light is at the end of the tunnel, when I lost my way!\nYou are our angel, my sunshine, my everything! \nWithout you, I will not be what I am today.\n@rainbowstairways @wwjypiglet @ruby_twinkie",
        "owner": {
            "id": "1463773740",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/42341769_242730833069472_1128908694642229248_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=Q8l3uqd5e_wAX_MXsBg&oh=e8bc33600461e3919a3245e2151e1287&oe=5F2CA5F7",
            "username": "invleftb4"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18140367142000379,
        "created_at": 1588842944,
        "text": "👏",
        "owner": {
            "id": "4316816287",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/18879253_1983993525162790_6682041253611175936_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=CY29LRTR40AAX8k_UmZ&oh=881ce6556f2afdc906703f78783b2e67&oe=5F2D1E39",
            "username": "william.singapore"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17887515535551439,
        "created_at": 1588834324,
        "text": "my mom is #Powermom because she did an amazing job for bringing me to this world. Without her , I might not have what I suppose to had in this life ! Because of her great sacrifice , I am who I am today ! Everyday without fail , she ensure all her kids have good meals and ensure her husband have good meals too as we are a big family , she cooked ,she clean up our house and give is a wonderful house ! And also a family whoa are closed enough ! She herself is not educated so she will not blame us on our studies if we did badly ! But still nevertheless she help us in basic words ! But all her 4 kids done her proud , because 4 kids get good results and always top 10 in class without any guidance from parents or tuition ! She give us the best in our life ! For instance when we are young , we might not be rich but my mum will work and get her pay to buy the things we want ! And also everytime when i was in kindergarten , she will bring me to school and fetch me off from school . A mum like her is hard to find , a lady who love her family and willing to give the best ! She is still the one helping me looking after baby because during my after birth , i almost get onto depression but mummy is the one who sacrifice all her time and sleep to help me look after baby till now . So i think she is really a superwoman who deserve a reward . And what's more she help me throughout pregnancy , after birth and confinement and now still helping me looking after baby everyday and night while i went out to work. Her love to me and baby is unconditional love and same to me i love her like how she love us but \nWords cant describe much but still got to say happy mother day ! So hope to win and surprise her ! @xxbeexx__ @kanglaychoo @limkahkoon",
        "owner": {
            "id": "1193195876",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/11939605_778284642282453_698686887_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=QlHTcXlc5pUAX8ifsFA&oh=92fc4056d6ab18a4a7c298bf476735d1&oe=5F2EA918",
            "username": "weeqiweeqi"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18102121819150478,
        "created_at": 1588819865,
        "text": "The honor goes to our guardian, aka Founder of our corporation! He's like a #PowerMom giving us all we need to SHINE🌟 with:\n\nLoving\nObliging\nValue\nEndless support \n@_felc_ @papiercoeurss @felfortheworld #stayhomewithgeneco",
        "owner": {
            "id": "4007064439",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/28754518_1994773814122238_371061599298912256_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=Mu_L8GqCPrEAX9yvYz-&oh=5cd3eb33d53c412f0c2673dddba20be6&oe=5F2EA2BB",
            "username": "humjinpeng"
        },
        "likes_count": 1,
        "answers": [
            {
                "id": 17853392741001213,
                "created_at": 1588819996,
                "text": "To the next decade ahead together!!",
                "owner": {
                    "id": "4007064439",
                    "is_verified": false,
                    "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/28754518_1994773814122238_371061599298912256_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=Mu_L8GqCPrEAX9yvYz-&oh=5cd3eb33d53c412f0c2673dddba20be6&oe=5F2EA2BB",
                    "username": "humjinpeng"
                },
                "likes_count": 0
            }
        ]
    },
    {
        "id": 17926202629387844,
        "created_at": 1588818375,
        "text": "My power mom definitely goes to my MUM! She has been a pillar of support during my ups and downs of life, and has been taking care of our family with endless care and love ❤️ #PowerMom #stayhomewithgeneco \nWhat about you all! @xxiuhua @sharon_ristretto @jaslynnsoh",
        "owner": {
            "id": "1154240",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/73381094_2608074732564199_2881249445830197248_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=pIAZj37oVIcAX-Bm9dj&oh=0691d8e13871252f8ddf3b10e9eeea7b&oe=5F2CD445",
            "username": "weiting4uuu"
        },
        "likes_count": 3,
        "answers": []
    },
    {
        "id": 17886710296557891,
        "created_at": 1588775650,
        "text": "It's the most selfless job in the world.\n\nShe works 24/7, unpaid and overtime and even faces criticism from us sometimes and still she puts in the effort every single day to shower us with love and affection. Mother's Day should not be just one day per year, but every moment of our lives.\n\n@geezywing @literallydevice @edwinrawrrr",
        "owner": {
            "id": "250385892",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/37269545_2240276256195646_7490329518620540928_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=6kHLn6dpF2MAX9q9ZpR&oh=e08daa7f4bf0d155cbc5a7fd2d293f5f&oe=5F2BDE1E",
            "username": "_xgrace"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17859985858868978,
        "created_at": 1588767389,
        "text": "My Power Mom is my dearest mummy! She has dedicated her life to the family. She left her job and chose to stay home to take care of the family after dad left us. She wasn’t good at cooking, but she learned it through youtube, so we can enjoy nutritious homecooked food everyday. She wasn’t good at cleaning, but she always ensure the home is well maintained and clean for us to stay in. She wasn’t good at baking, but she learned it herself, just so she can bake a cake on our birthdays. She never fails to bake a cake on every of our birthdays. She learns activities we like, just so she can communicate and blend in with us . She put in extra effort when things are not second nature to her. \nShe wakes up the earliest in the morning to prepare breakfast for us and always ensure that everyone leaves the house for work or school with a full stomach. She never fails to cook our favourite dishes every time we are home. At night, she will ensure that we are all home safely (no matter how late it is), before she sleeps. She wakes up the earliest and sleeps the latest in the family. \nThis journey as a single mother wasn't easy but she made it. She is brave, independent and strong. \nI am grateful to have her shower me with her love and attention. \nI am glad to have her standing by me, even when i am being difficult. \nI am blessed to have her holding my small hands all these while and never once thought of letting it go. \nI am thankful to have her love me when I am so hard to love. \n@gnxy @mrs_serene_lim @x3eunnie",
        "owner": {
            "id": "1077091763",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/11856798_1623006067988512_1772313609_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=_AS9CrflFesAX_6aopV&oh=169a39a63e51d0ea6007301940cda431&oe=5F2DE20D",
            "username": "slkl21"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17844947390126720,
        "created_at": 1588756732,
        "text": "My mum called Mother-in-Law, Susheela  is my Power Mom  who made me laugh.... wiped my tears....hugged me tight....cheered me on... going strong....drove me little crazy at times.... A mother for 9 child a grand Mother for 14 grand children, sacrificed her life as a full time home maker taking care of the family needs and cooking healthy delicious food 365 days all round the clock, from breakfast to suppers. Besides she is a Carnatic Singer who in her little leisure time volunteers to teach music to the children who cannot afford and and performs in Temples and bring back her childhood hobby to life in her late 70’s. Further age never stopped her hobby of growing a nursery at the backyards of the house, plenty of organic fruits, vegetables and flowers. She always insists and inspire others that age is not a barrier if we are determined in achieving our goals. She always explains us that Love is the only gift that one generation can pass on to the others and always family come first and make our life happiest within our means,  keep smiling to vibrate  an healthy environment. Life is a journey and there will be rainbows in our way to shade our cloudy days. She is indeed a Super woman who has surpassed several tsunamis of life with. Every minute of my life spent with you is amazing and meaningful. Mom, You are indeed a Super Mom with simple living and high thinking in nature with generosity, graciousness and magnanimity. A salute to my Super Mom from the bottom of my heart. \n#stayhomewithgeneco #PowerMom\n@grandhi1234 \n@chandkrishsai \n@prakashg40",
        "owner": {
            "id": "216652648",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/1171200_1041501669221426_1829402685_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=gJC99BLftE4AX_BnIT8&oh=d04f7c51bac07cfbb2b0dcdd701878f4&oe=5F2D8889",
            "username": "anuradha1748"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17892779911505677,
        "created_at": 1588749711,
        "text": "🙌 @iamalicetan 🙌",
        "owner": {
            "id": "2990464772",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/75352115_442814086409468_4003263257673465856_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=nb2Y8nQ6xS4AX9lBDBk&oh=2bb7e4fb6b194e3cd71eb86c353b0140&oe=5F2C7600",
            "username": "donalovesherlife"
        },
        "likes_count": 0,
        "answers": []
    }
]