[
    {
        "id": 17857131334904151,
        "created_at": 1589256254,
        "text": "Oh, I did forget one more thing, I did the extra hard work of frying up some shallots to sprinkle on top of the rice noodles rolls.  You can leave this one out if you don't love fried shallots.  I'm not a huge fan but some people love it.  Add a sprig of coriander (or poison herb) on top to add a wow factor to the dish! 😋",
        "owner": {
            "id": "2297281214",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/87544964_641598469938079_1270258482125209600_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=-U9VQrWqHycAX-YbtU7&oh=c437ef2c46105725e4b0aef7063a996d&oe=5F2B714B",
            "username": "ozteopath"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17882998327583614,
        "created_at": 1589256081,
        "text": "B. Add some green herbs to make it pretty\n- chop some spring onions. I had none so I used chopped coriander or as some people call it, chopped poison\nC. For dried shrimp rice noodle rolls\n- wash some dried shrimp and soak it for a while in water or the dish will be very salty\n- you can use the shrimp as is but I like to chop them into smaller pieces. It also makes the roll less likely to tear with the smaller pieces\n.\n4. Place dry ingredients below into a mixing bowl, add water and mix thoroughly:\n- 1 cup rice flour\n- 2 cups water\n- 1 tablespoon of cornflour\n- 1 tablespoon of tapioca flour\n- pinch of salt\n- tablespoon of oil\n.\n5. Now the fun begins! Steaming rice paper rolls!\n- place tray in the steamer\n- be careful not to burn yourself as this is when things are going to get hot and steamy!\n- brush oil onto the steaming tray - stir the flour mixture everytime you do one rice noodle roll or it won't work out as the flour will sink to the bottom of bowl if it's been sitting there for a bit\n- ladle the flour mixture into the steaming tray so that it is about 1-2mm thick\n- sprinkle some spring onion or corinder evenly and if doing the dried shrimp rice noodle roll, sprinkle some dried shrimp evenly\n- cover and steam on high for 5-8 minutes. Trial and error the timing as it depends. Use the spatula and see if the rice noodle will lift off the pan without sticking too much\n- once done, take out steaming tray and gently roll the rice noodle roll\n- if doing the prawn rice noodle roll (remember not to use the dried shrimp) place 2-3 prawns in a row about 2cm from the edge and flip the rice noodle roll over the prawns and gently roll them up\n.\n5. Serve up the steamed rice noodle rolls with a drizzle of the soy sauce mixture and voila you have a meal! Enjoy! 😋❤️",
        "owner": {
            "id": "2297281214",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/87544964_641598469938079_1270258482125209600_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=-U9VQrWqHycAX-YbtU7&oh=c437ef2c46105725e4b0aef7063a996d&oe=5F2B714B",
            "username": "ozteopath"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 17853960913984768,
        "created_at": 1589256046,
        "text": "This recipe makes about 8-10 steamed rice noodle rolls depending how big your tray is.\n.\n1. Prepping the equipment\n- prep a wok with a lid or a steamer with a lid that can fit a small to medium sized square/rectangular non-stick baking tray or glass tray\n- fill up water in the steamer. You will need to keep topping up the water as it will dry up really fast after one or two rice noodle rolls\n- ladle for the rice flour mix\n- small bowl of oil with brush\n- silicon spatula for rolling the rice noodles\n.\n2. Prep the soy sauce for the rice noodle roll. This is the part where I don't measure and agak agak (eyeball) the amounts. Add the following into a pan and just warm up on gentle heat to dissolve the sugar:\n- soy sauce (or Tamari) maybe about 4 tablespoons\n- sugar (or Lakanto) to taste which was maybe about 1-2 teaspoons. Add a bit at a time so you can taste it as you go along\n- about 2 tablespoons of water\n- splash of sesame oil (less is more)\n- place aside in a bowl for later\nThe alternatives given above are my low carb alternatives. Mind you, the rice noodle roll is already carb anyway! 😅\n.\n3. Prepping the tasty ingredients to go inside the rice noodle roll:\nA. For the prawn rice noodle rolls you will need to cook the prawns first. I usually estimate 2-3 prawns per roll and two prawns is easier to roll up than three so don't be too greedy yet!\n- peel and de-vein prawns if using fresh. I prefer to use frozen ones for less work\n- place prawns into bowl (that you can just place in the steamer) and mix about 1/2-1 teaspoon of baking soda with the prawns. Fill up bowl with water and let it sit for 20-30 minutes. This is what makes the prawn firm and crunchy.\n- pour away the baking soda solution and give the prawns a good rinse. The baking soda has done its job and you don't want the awful taste in the prawn\n- add a spoonful and maybe a bit more of the soy sauce prepped earlier - add pepper\n- mix it in well\n- I usually let the prawns marinate for a bit but it's not totally necessary\n- place the bowl into the steamer and steam on high for about 4-5 mins until the prawn flesh is opaque\n- set aside for the steamed rice paper roll",
        "owner": {
            "id": "2297281214",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/87544964_641598469938079_1270258482125209600_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=-U9VQrWqHycAX-YbtU7&oh=c437ef2c46105725e4b0aef7063a996d&oe=5F2B714B",
            "username": "ozteopath"
        },
        "likes_count": 0,
        "answers": []
    },
    {
        "id": 18142514257003357,
        "created_at": 1589124153,
        "text": "Mad skills sis!!",
        "owner": {
            "id": "12018177",
            "is_verified": false,
            "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/11934846_1653458538274603_1068563353_a.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=zfVcxeUAtBwAX_3coKA&oh=27215e164d952546e9e1cd45266e5280&oe=5F2AC4E6",
            "username": "simernarulla"
        },
        "likes_count": 1,
        "answers": [
            {
                "id": 17859716896883749,
                "created_at": 1589138909,
                "text": "@simernarulla thanks buddy!  First timer so heaps of room for improvement... Still pretty happy with the first try... 😋😊",
                "owner": {
                    "id": "2297281214",
                    "is_verified": false,
                    "profile_pic_url": "https://scontent-sin6-2.cdninstagram.com/v/t51.2885-19/s150x150/87544964_641598469938079_1270258482125209600_n.jpg?_nc_ht=scontent-sin6-2.cdninstagram.com&_nc_ohc=-U9VQrWqHycAX-YbtU7&oh=c437ef2c46105725e4b0aef7063a996d&oe=5F2B714B",
                    "username": "ozteopath"
                },
                "likes_count": 1
            }
        ]
    }
]